Revit 2024 API
PipeFittingAndAccessoryPressureDropData.GetPipeFittingAndAccessoryData Method
 Returns the fitting and accessory information
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData()
Visual Basic
Public Function GetPipeFittingAndAccessoryData As PipeFittingAndAccessoryData
Visual C++
public:
PipeFittingAndAccessoryData^ GetPipeFittingAndAccessoryData()
See Also
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace